character_dictionary = {
    1: {
        "name": "Майкл Де Санта",
        "description": "Майкл Де Санта является отставным грабителем банков,"
        " который, после заключения сделки с ФРБ, переехал вместе с семьёй в Лос-Сантос,"
        " где они живут в хорошем особняке. Его жена, Аманда, беспощадно тратит деньги,"
        " украденные Майклом за годы жизни."
        " Это, а также сложные отношения с членами семьи и огромные долги заставляют его вернуться в криминальную жизнь ещё раз,"
        " на этот раз, опираясь на своего старого партнёра Тревора Филипса, а также на нового знакомого Франклина Клинтона.",
        "voiced_by": "Озвучен Недом Люком."
    },

    2: {
        "name": "Франклин Клинтон",
        "description": "Франклин Клинтон — молодой афроамериканец, желающий добиться успешной карьеры в криминальном мире Лос-Сантоса."
                        " Он работает реквизитором на владельца автосалона роскошных автомобилей,"
                        " однако его амбициозность заставляет его покинуть это дело."
                        "Вскоре Франклин встречает Майкла, когда-то успешного налётчика на банки,"
                        " между ними завязываются очень близкие отношения. Вместе с Тревором Филипсом они совершают ряд ограблений,"
                        " вскоре становясь богачами.",
        "voiced_by": "Озвучен Шоном Фонтено."
    },
    3: {
        "name": "Тревор Филипс",
        "description": "Тревор Филипс является психически неуравновешенным и бывшим грабителем банков"
                     " вместе со своим тогдашним партнёром Майклом Таунли. Бывший военный лётчик,"
                     " Тревор перебрался в Сан-Андреас, где основал «Тревор Филипс Энтерпрайзис»,"
                     " которое в основном занимается оружием и наркотиками."
                     "Живёт в маленьком трейлере в пустыне Гранд-Сенора, Сан-Андреас."
                     " В 2013 году Тревор снова связался со своим давним партнёром Майклом и познакомился с Франклином,"
                     " и они стали грабить заведения крупнейших корпораций мегаполиса.",
        "voiced_by": "Озвучен Стивеном Оггом."
    },
    4: {
        "name": "Лестер Крест",
        "description": "Лестер Крест является старым другом Майкла и идейным вдохновителем во время планирования ограблений с Майклом,"
                    " Франклином и Тревором. Он также выдаёт Франклину миссии по убийствам.",
        "voiced_by": "Озвучен Джеем Клейтцем."
    },
    5: {
        "name": "Дейв Нортон",
        "description": "Дейв Нортон является агентом ФРБ и хорошим другом Майкла."
                   " Он устроил Майкла в программу по защите свидетелей и пишет письма Тревору под видом Брэда Снайдера.",
        "voiced_by": "Озвучен Джулианом Гэмблом."
    },
    6: {
        "name": "Ламар Дэвис",
        "description": "Ламар Дэвис является одним из лучших друзей Франклина."
                   " Описанный как «сумасшедший», Ламар имеет противоположные идеалы с Франклином,"
                   " что часто приводит к спорам и дискуссиям между ними.",
        "voiced_by": "Озвучен Слинком Джонсоном."
    },
    7: {
        "name": "Стив Хейнс",
        "description": "Стив Хейнс — на первый взгляд очень порядочный и принципиальный,"
                  " а на деле очень коррумпированный агент ФРБ. Используя свое служебное положение,"
                  " как начальник Дейва Нортона, Хейнс использует Майкла, Франклина и Тревора, чтобы сломить ЦУР",
        "voiced_by": "Озвучен Робертом Богом."
    },
    8: {
        "name": "Дэвин Уэстон",
        "description": "Дэвин Уэстон — бизнесмен-миллиардер, заинтересованный во многих предприятиях штата Сан-Андреас,"
                       " в том числе в Merryweather Security."
                       " Завербованные Стивом Хейнсом, Майкл, Франклин и Тревор работают на него, но вскоре становятся врагами олигарха,"
                       " после того как Уэстон отказывается платить троице и после того как Уэстон решает уничтожить плёнку фильма Richards Majestic,"
                       " продюсером которого является Майкл.",
        "voiced_by": "Озвучен Джонатаном Уокером."
    },
    9: {
        "name": "Аманда Де Санта",
        "description": "Аманда Де Санта — жена Майкла, и мать Джимми и Трейси."
                       " Когда-то она была очень близка мужу, но их отношения стали шаткими,"
                       " и Аманда начала тратить большую часть его денег.",
        "voiced_by": "Озвучена Вики Ван Тассел."
    },
    10: {
        "name": "Джимми Де Санта",
        "description": "Джимми Де Санта является сыном Майкла и Аманды,"
                       " и братом Трейси. Молодой человек в возрасте 20 лет."
                       " Джимми — ленивый курильщик, который, как и другие члены его семьи,"
                       " имеет сложные отношения с отцом.",
        "voiced_by": "Озвучен Дэнни Тамберелли."
    },
    11: {
        "name": "Трейси Де Санта",
        "description": "Трейси Де Санта — дочь Майкла и Аманды и сестра Джимми Де Санты."
                       " У неё очень сложные отношения с родителями, особенно с матерью,"
                       " которая не любит парня Трейси, называя его бродягой. Её отношения с отцом также далеки от совершенства",
        "voiced_by": "Озвучена Михал Синнотт."
    },
    12: {
        "name": "Бред Снайдер",
        "description": "Брэдли «Брэд» Снайдер — старый друг Майкла и Тревора, который был убит в миссии Prologue.",
        "voiced_by": "Озвучен Райаном Вудлом."
    },
    13: {
        "name": "Стретч",
        "description": "Гарольд «Стретч» Джозеф — старый член банды The Families и один из старых друзей Ламара и хороший знакомый Франклина,"
              " имеет большую неприязнь к последнему."
              " Является одним из второстепенных антагонистов в случае принятия варианта C.",
        "voiced_by": "Озвучен Хассаном Джонсоном."
    },
    14: {
        "name": "Вэй Чэн",
        "description": "Вэй Чэн является лидером Триад Лос-Сантоса и отцом Тао."
               " В отместку за то, что Тревор разрушил его перспективы для ведения бизнеса в округе Блэйн,"
               " он похищает Майкла в попытке поймать Тревора. Может быть вторичным антагонистом,"
               " если игрок выбирает вариант С.",
        "voiced_by": "Озвучен Джорджем Чуном."
    },
    15: {
        "name": "Мартин Мадрасо",
        "description": "Соломон Ричардс является вайнвудским продюсером и владельцем Richards Majestic."
                      " Представленный Ричардсу Майкл Дэвином,"
                      " они заводят хорошую дружбу, после чего Майкл помогает Ричардсу в проблемах,"
                      " связанных с его последним фильмом «Meltdown».",
        "voiced_by": "Озвучен Альфредо Уэрекой."
    },
    16: {
        "name": "Рон Джековски",
        "description": "Рональд «Рон» Джековски — друг Тревора, живущий в трейлере,"
                     " расположенном в Сэнди-Шорс, округ Блэйн."
                     " Он является параноидальным сторонником теорий заговора и проводит радио-шоу на Blaine County Talk Radio.",
        "voiced_by": "Озвучен Дэвидом Могентейлом."
    },
    17: {
        "name": "Соломон Ричардс",
        "description": "Соломон Ричардс является вайнвудским продюсером и владельцем Richards Majestic."
                       " Представленный Ричардсу Майкл Дэвином, они заводят хорошую дружбу,"
                       " после чего Майкл помогает Ричардсу в проблемах, связанных с его последним фильмом «Meltdown».",
        "voiced_by": "Озвучен Джоэлом Руксом."
    },
    18: {
        "name": "Уэйд Геберт",
        "description": "Уэйд Геберт — друг Тревора и Рона. Является умственно отсталым,"
                   " поэтому помогает Тревору лишь в рабочих делах и проблемах.",
        "voiced_by": "Озвучен Мэтью Махером."
    },
    19: {
        "name": "Молли Шульц",
        "description": "Молли Шульц являлась старшим вице-президентом и главным юрисконсультом в компании Дэвина Уэстона.",
        "voiced_by": "Озвучена Элизабет Мейсон."
    }


}

def get_character_names_list():
    character_names = []
    for i in character_dictionary:
        character_names.append(character_dictionary[i]["name"])
    return character_names

def find_charracter_by_name(name):
    for i in character_dictionary:
        if name.lower() == character_dictionary[i]["name"].lower():
            return character_dictionary[i]

def check_character_exists(name):
    for i in character_dictionary:
        if name.lower() == character_dictionary[i]["name"].lower():
            return True
    return False


